app/Controllers/ClientController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 2
---
    public function accueil()
    {
        if (session('role') !== 'client') {
            return redirect()->to('/login');
        }

        $clientId = session('client_id');
        if (!$clientId) {
            return redirect()->to('/login');
        }

        $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 2
---
    public function solde()
    {
        if (session('role') !== 'client') {
            return redirect()->to('/login');
        }

        $clientId = session('client_id');
        if (!$clientId) {
            return redirect()->to('/login');
        }

        $client = $this->clientModel->find($clientId);