app/Controllers/OperatorController.php

    public function comptes()
    {
        if (session('role') !== 'operator') {
            return redirect()->to('/operator/login');
        }

        $clientModel = new ClientModel();
        $operationModel = new OperationModel();
        $operateurCourant = session('operator_network') ?? 'yas';

        $allClients = $clientModel->findAll();
---
SELECT *
FROM `clients`