app/Controllers/OperationController.php

    public function transfert()
    {
        if (!$this->ensureClient()) {
            return redirect()->to('/login');
        }

        $clientId = session('client_id');
        if (!$clientId) {
            return redirect()->to('/login');
        }

        $montant = $this->request->getPost('montant');
        $destinataire = $this->request->getPost('destinataire');
        if ($montant !== null && $destinataire) {
            $client = $this->clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2