app/Models/BaremeFraisModel.php

SELECT `baremes_frais`.*, `types_operation`.`nom` as `type_operation_nom`
FROM `baremes_frais`
LEFT JOIN `types_operation` ON `types_operation`.`id` = `baremes_frais`.`type_operation_id`
ORDER BY `baremes_frais`.`type_operation_id` ASC, `baremes_frais`.`montant_minimum` ASC
---
    public function getBaremes(): array
    {
        return $this->select('baremes_frais.*, types_operation.nom as type_operation_nom')
            ->join('types_operation', 'types_operation.id = baremes_frais.type_operation_id', 'left')
            ->orderBy('baremes_frais.type_operation_id', 'ASC')
            ->orderBy('baremes_frais.montant_minimum', 'ASC')
            ->findAll();