app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0320200494'
 LIMIT 1
INSERT INTO `clients` (`telephone`, `solde`) VALUES ('0320200494', 0)
SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    public function trouverOuCreerClient(string $telephone): ?array
    {
        $this->initialiserSchema();

        $telephoneNormalise = $this->normaliserTelephone($telephone);

        $client = $this->where('telephone', $telephoneNormalise)->first();

        if ($client) {
            return $client;
        }

        $id = $this->insert([
            'telephone' => $telephoneNormalise,
            'solde' => 0,
        ]);

        return $id ? $this->find($id) : null;

UPDATE `clients` SET `solde` = -5883.75
WHERE `clients`.`id` IN (3)
---
    public function modifierSolde(int $id, float $nouveauSolde): bool
    {
        return $this->update($id, ['solde' => $nouveauSolde]);