app/Models/OperationModel.php

INSERT INTO `operations` (`client_id`, `type_operation_id`, `destinataire`, `montant`, `frais`, `date_operation`) VALUES (3, 3, '0341800003', 2100, 183.75, '2026-07-20 13:55:15')
---
    public function enregistrerOperation(array $data): int
    {
        $this->initialiserSchema();
        return $this->insert($data);

SELECT `operations`.*, `types_operation`.`nom` as `type_operation`
FROM `operations`
LEFT JOIN `types_operation` ON `types_operation`.`id` = `operations`.`type_operation_id`
WHERE `operations`.`client_id` = 3
ORDER BY `operations`.`date_operation` DESC
---
    public function getHistoriqueClient(int $clientId): array
    {
        $this->initialiserSchema();

        $rows = $this->select('operations.*, types_operation.nom as type_operation')
            ->join('types_operation', 'types_operation.id = operations.type_operation_id', 'left')
            ->where('operations.client_id', $clientId)
            ->orderBy('operations.date_operation', 'DESC')
            ->findAll();

SELECT *
FROM `prefixes`
ORDER BY LENGTH(prefixe) DESC
---
    public function getOperateurParTelephone(string $telephone): ?string
    {
        $this->initialiserSchema();
        $prefixes = $this->db->table('prefixes')->orderBy('LENGTH(prefixe)', 'DESC')->get()->getResultArray();

SELECT `operations`.*, `types_operation`.`nom` as `type_operation`
FROM `operations`
LEFT JOIN `types_operation` ON `types_operation`.`id` = `operations`.`type_operation_id`
SELECT *
FROM `clients`
WHERE `id` = 1
---
    public function getGainsDetail(string $operateurCourant): array
    {
        $this->initialiserSchema();
        $baremeModel = new \App\Models\BaremeFraisModel();

        $operations = $this->select('operations.*, types_operation.nom as type_operation')
            ->join('types_operation', 'types_operation.id = operations.type_operation_id', 'left')
            ->findAll();

        $gains = [
            'total'              => 0,
            'meme_operateur'     => 0,
            'autres_operateurs'  => 0,
            'commissions'        => 0,
            'par_type'           => []
        ];

        $montantsAEnvoyer = [];

        foreach ($operations as $op) {
            $client = $this->db->table('clients')->where('id', $op['client_id'])->get()->getRowArray();