app/Models/PrefixeModel.php

    protected function initialiserSchema(): void
    {
        if ($this->db->tableExists($this->table)) {
            if ($this->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `prefixes`

    public function getPrefixes(): array
    {
        $this->initialiserSchema();
        return $this->orderBy('prefixe', 'ASC')
            ->findAll();
---
SELECT *
FROM `prefixes`
ORDER BY `prefixe` ASC